#Использовать asserts
#Использовать ".."

&Тест
Процедура ТестДолжен_ПроверитьПотреблениеПамятиБуферомДвоичныхДанных() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.01;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	МониторПамяти.Начать();

	Буфер = Новый БуферДвоичныхДанных(Размер);

	ВыделеноБайт = МониторПамяти.Завершить();

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(Размер, Размер * Погрешность);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьПотреблениеПамятиБуферомДвоичныхДанныхСОчисткой() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.01;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	МониторПамяти.Начать();

	Буфер = Новый БуферДвоичныхДанных(Размер);
	Буфер = NULL;

	ВыделеноБайт = МониторПамяти.Завершить();

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(Размер, Размер * Погрешность);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьПотреблениеПамятиДляНесколькихБуферовДвоичныхДанных() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.01;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	МониторПамяти.Начать();

	Буфер1 = Новый БуферДвоичныхДанных(Размер);
	Буфер2 = Новый БуферДвоичныхДанных(Размер);
	Буфер3 = Новый БуферДвоичныхДанных(Размер);

	ВыделеноБайт = МониторПамяти.Завершить();

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(3 * Размер, 3 * Размер * Погрешность);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьПотреблениеПамятиДляНесколькихБуферовДвоичныхДанныхСПерезаписьюПеременной() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.01;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	МониторПамяти.Начать();

	Буфер = Новый БуферДвоичныхДанных(Размер);
	Буфер = Новый БуферДвоичныхДанных(Размер);
	Буфер = Новый БуферДвоичныхДанных(Размер);

	ВыделеноБайт = МониторПамяти.Завершить();

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(3 * Размер, 3 * Размер * Погрешность);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьРазмерКучи() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.02;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	
	НачальныйРазмер = МониторПамяти.РазмерКучи();

	Буфер = Новый БуферДвоичныхДанных(Размер);

	ВыделеноБайт = МониторПамяти.РазмерКучи() - НачальныйРазмер; // Такой подоход только для тестирования

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(Размер / Погрешность, Размер * Погрешность);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВсегоВыделеноБайт() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.01;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	
	НачальныйРазмер = МониторПамяти.ВсегоВыделеноБайт();

	Буфер = Новый БуферДвоичныхДанных(Размер);

	ВыделеноБайт = МониторПамяти.ВсегоВыделеноБайт() - НачальныйРазмер;

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(Размер, Размер * Погрешность);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапретитьЗавершениеБезНачала() Экспорт

	МониторПамяти = Новый МониторПамяти();

	Ожидаем.Что(МониторПамяти)
		.Метод("Завершить")
		.ВыбрасываетИсключение("Замер памяти не был начат");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапретитьПовторноеЗавершение() Экспорт

	МониторПамяти = Новый МониторПамяти();
	МониторПамяти.Начать();
	МониторПамяти.Завершить();

	Ожидаем.Что(МониторПамяти)
		.Метод("Завершить")
		.ВыбрасываетИсключение("Замер памяти не был начат");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапретитьПовторноеНачало() Экспорт

	МониторПамяти = Новый МониторПамяти();
	МониторПамяти.Начать();

	Ожидаем.Что(МониторПамяти)
		.Метод("Начать")
		.ВыбрасываетИсключение("Замер памяти уже начат");

	МониторПамяти.Завершить();

КонецПроцедуры
